{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"input_5:0": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}, "input_6:0": {"name": "input_6:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "22"}, {"size": "11"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_5/flatten_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5/flatten_5/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "242"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5/concatenate_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_5", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}}}, {"name": "input_6", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "22"}, {"size": "11"}]}}}}, {"name": "StatefulPartitionedCall/functional_5/flatten_4/Reshape", "op": "Reshape", "input": ["input_5", "StatefulPartitionedCall/functional_5/flatten_4/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_5/flatten_5/Reshape", "op": "Reshape", "input": ["input_6", "StatefulPartitionedCall/functional_5/flatten_5/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_5/dense_6/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_5/flatten_4/Reshape", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5/dense_7/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_5/flatten_5/Reshape", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_5/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_5/dense_6/Relu", "StatefulPartitionedCall/functional_5/dense_7/Relu", "StatefulPartitionedCall/functional_5/concatenate_2/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_5/dense_8/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_5/concatenate_2/concat", "unknown_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5/dense_8/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_5/dense_8/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_5/dense_8/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_5/flatten_4/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [12544, 64], "dtype": "float32"}, {"name": "unknown_0", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5/flatten_5/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_1", "shape": [242, 64], "dtype": "float32"}, {"name": "unknown_2", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5/concatenate_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_3", "shape": [128, 2], "dtype": "float32"}]}]}