{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"input_7:0": {"name": "input_7:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}, "input_8:0": {"name": "input_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_7/flatten_6/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/flatten_7/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/concatenate_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_7", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_8", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}}}, {"name": "StatefulPartitionedCall/functional_7/flatten_6/Reshape", "op": "Reshape", "input": ["input_7", "StatefulPartitionedCall/functional_7/flatten_6/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_7/flatten_7/Reshape", "op": "Reshape", "input": ["input_8", "StatefulPartitionedCall/functional_7/flatten_7/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_7/dense_9/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_7/flatten_6/Reshape", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_7/dense_10/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_7/flatten_7/Reshape", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7/dense_9/Relu", "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7/dense_10/Relu", "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/mul_1", "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/mul_1", "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/concatenate_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/add_1", "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/add_1", "StatefulPartitionedCall/functional_7/concatenate_3/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_7/dense_11/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_7/concatenate_3/concat", "unknown_11"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7/dense_11/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_7/dense_11/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_7/dense_11/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_7/flatten_6/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_1", "shape": [12544, 64], "dtype": "float32"}, {"name": "unknown_2", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_2/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7/flatten_7/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [12544, 64], "dtype": "float32"}, {"name": "unknown_0", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7/batch_normalization_3/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7/concatenate_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_11", "shape": [128, 2], "dtype": "float32"}]}]}