{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"input_142:0": {"name": "input_142:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}, "input_143:0": {"name": "input_143:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_141/flatten_141/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/flatten_142/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/concatenate_70/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_142", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_143", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "7"}, {"size": "256"}]}}}}, {"name": "StatefulPartitionedCall/functional_141/flatten_141/Reshape", "op": "Reshape", "input": ["input_142", "StatefulPartitionedCall/functional_141/flatten_141/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_141/flatten_142/Reshape", "op": "Reshape", "input": ["input_143", "StatefulPartitionedCall/functional_141/flatten_142/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_141/dense_233/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_141/flatten_141/Reshape", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_141/dense_234/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_141/flatten_142/Reshape", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_141/dense_233/Relu", "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_141/dense_234/Relu", "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/mul_1", "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/mul_1", "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/concatenate_70/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/add_1", "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/add_1", "StatefulPartitionedCall/functional_141/concatenate_70/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_141/dense_235/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_141/concatenate_70/concat", "unknown_11", "unknown_12"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_141/dense_235/Relu", "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/mul_1", "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_141/dense_236/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/add_1", "unknown_17"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_141/dense_236/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_141/dense_236/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_141/dense_236/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_141/flatten_141/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_1", "shape": [12544, 128], "dtype": "float32"}, {"name": "unknown_2", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_158/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/flatten_142/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [12544, 128], "dtype": "float32"}, {"name": "unknown_0", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_159/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/concatenate_70/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_11", "shape": [256, 32], "dtype": "float32"}, {"name": "unknown_12", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_141/batch_normalization_160/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "unknown_17", "shape": [32, 2], "dtype": "float32"}]}]}